In [1]:
import pandas as pd
import sqlite3

In [2]:
cnx = sqlite3.connect('./db.sqlite3')

### Жанры-произведения ###

In [3]:
gt = pd.read_csv('genre_title.csv', index_col='id')
gt.head()

    title_id  genre_id
id
1          1         1
2          2         1
3          3         1
4          4         1
5          5         2

In [4]:
gt.to_sql('reviews_title_genre_name', cnx, if_exists='replace', index=False)

42

### Жанры ###

In [5]:
genres = pd.read_csv('genre.csv', index_col='id')
genres.head()

          name     slug
id
1        Драма    drama
2      Комедия   comedy
3      Вестерн  western
4      Фэнтези  fantasy
5   Фантастика   sci-fi

In [6]:
genres.to_sql('reviews_genre', cnx, if_exists='replace', index=False)

15

### Категории

In [7]:
categories = pd.read_csv('category.csv', index_col='id')
categories

      name   slug
id
1    Фильм  movie
2    Книга   book
3   Музыка  music

In [8]:
categories.to_sql('reviews_category', cnx, if_exists='replace', index=False)

3

### Произведения

In [9]:
titles = pd.read_csv('titles.csv', index_col='id')
#titles = titles.rename(columns={'category': 'category_id'})
titles.head()

                      name  year  category_id
id
1        Побег из Шоушенка  1994            1
2            Крестный отец  1972            1
3   12 разгневанных мужчин  1957            1
4          Список Шиндлера  1993            1
5       Криминальное чтиво  1994            1

In [10]:
titles.to_sql('reviews_title', cnx, if_exists='replace', index=False)

32

### Обзоры

In [11]:
reviews = pd.read_csv('review.csv', index_col='id')
reviews.head()

,title_id,text,author,score,pub_date
id,,,,,
1,1,Ставлю десять звёзд!\n...Эти голоса были чище ...,100,10,2019-09-24T21:08:21.567Z
2,1,Не привыкай\n«Эти стены имеют одно свойство: с...,101,10,2019-09-24T21:08:21.567Z
3,2,"Фильм, разобранный на цитаты, достоин высшей о...",102,10,2019-09-24T21:08:21.567Z
4,2,"Жестокий, жестокий, жестокий мир, не о таком м...",103,1,2019-09-24T21:08:21.567Z
5,2,"Это мои соседи! Ставлю три звезды за то, что о...",104,3,2019-09-24T21:08:21.567Z

In [12]:
reviews.to_sql('reviews_review', cnx, if_exists='replace', index=False)

72

### Комментарии

In [13]:
comments = pd.read_csv('comments.csv', index_col='id')
#comments = comments.rename(columns={'author': 'author_id'})
comments.head()

,review_id,text,author,pub_date
id,,,,
1,6,"Ничего подобного, в фильме всё не так, и прогр...",102,2020-01-13T23:20:02.422Z
2,6,"Ну надо же, не нашлось ничего лучшего, кроме к...",101,2020-01-13T23:20:02.422Z
3,6,"Кстати, а что такое ""четверть фунта""? В грамма...",103,2020-01-13T23:20:02.422Z

In [14]:
comments.to_sql('reviews_comment', cnx, if_exists='replace', index=False)

3

### Юзеры

In [15]:
users = pd.read_csv('users.csv', index_col='id')
users

,username,email,role,bio,first_name,last_name
id,,,,,,
100,bingobongo,bingobongo@yamdb.fake,user,NaN,NaN,NaN
101,capt_obvious,capt_obvious@yamdb.fake,admin,NaN,NaN,NaN
102,faust,faust@yamdb.fake,user,NaN,NaN,NaN
103,reviewer,reviewer@yamdb.fake,user,NaN,NaN,NaN
104,angry,angry@yamdb.fake,moderator,NaN,NaN,NaN

In [16]:
users.to_sql('reviews_user', cnx, if_exists='replace', index=False)

5